In [2]:
import pandas as pd

customer_data = pd.read_csv('data/customer_data.csv')
customer_data.head()
#todo add business name eg James William Agriculutre - later

,Customer Name,uid,business sector,location,phone number,national ID,passport,tin,gender,education level,business start date
0,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,Agriculture,Fort Portal,256723196874,78602628,U6482628,8900454,Female,University,2013-02-25
1,James Nansukusa,7a1c5730-b8e7-4774-8746-90a317b73a82,Services,Kampala,256735895263,36028682,U1006980,7442154,Female,University,2009-02-22
2,Nansukusa Sarah,fb94fff4-9217-470f-9e80-12621dea6191,Fisheries,Lira,256790291092,22644880,U3152513,2102298,Male,Vocational,2009-02-07
3,Bridget Namwalwa,ff0563dc-6006-4b4f-a88a-1e7b64adb040,Manufacturing,Kisoro,256773437304,78654217,U3734663,9738952,Male,University,2016-04-15
4,William William,a185cde9-4893-42c0-bcad-fbcf101d2a77,Hospitality,Kampala,256712698533,71758895,U4129268,4037967,Male,Primary,2013-03-15

In [3]:
transactions_data = pd.read_csv('data/transactions_data.csv')
transactions_data.head()

,uid,Customer Name,amount,type,reason,date
0,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,975470.63,Credit,Purchase,2015-04-05
1,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,363069.20,Credit,Operating Expenses,2015-07-03
2,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,827680.47,Credit,Miscellaneous,2013-06-02
3,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,794316.00,Debit,Sale,2019-01-23
4,James William,cca67301-ef3c-4496-b8fd-31847b7edd88,488363.74,Debit,Operating Expenses,2023-02-03

In [4]:
print(f"Number of rows in transactions_data: {transactions_data.shape[0]}")

Number of rows in transactions_data: 89695

# Data cleaning
- Remove columns from customer_data df which are not needed for our analysis
- Add a new column to customer_data which shows the business duration
- Add new columsn which calculate the value: some value containng business age and number and amount of transactions (maybe business_score?)

# Encoding
Transforming data into machine readable numbers to facilitate the analysis process. 

## Define value we want encode
Business Sector, Location, Gender, Education level, business age, some value containng business age and number and amount of transactions

The features we choose should be abe to describe groups of rows (as compated to geatures like phone number)

## Creating dummy varialbes/ encoding
Creating numerical values from categorical features can be approached in several ways. 
The easiest is assigning a value to each value of a features. e.g 
 Business Sector
    - Agriculture : 1
    - Service : 2
    - Fisheries : 3
However, this is not effecient for clustering algorithms as it will give inaccurate clusters

A better approach is the use of one-hot encoding, where a value is 1 and only 1 possibilty, while the rest are 0